Public Attributes | List of all members
API_Element Union Reference
Element Manager
A union collecting all known element types. More...
#include <APIdefs_Elements.h>
 Public Attributes
 API_Elem_Head  | header
General element header.
 API_WallType  | wall
Represents a wall.
 API_ColumnType  | column
Represents a column.
 API_BeamType  | beam
Represents a beam.
 API_WindowType  | window
Represents a window.
 API_DoorType  | door
Represents a door.
 API_ObjectType  | object
Represents an object.
 API_LampType  | lamp
Represents a lamp.
 API_SlabType  | slab
Represents a slab.
 API_RoofType  | roof
Represents a roof.
 API_MeshType  | mesh
Represents a mesh.
 API_DimensionType  | dimension
Represents a dimension.
 API_RadialDimensionType  | radialDimension
Represents a radial dimension.
 API_LevelDimensionType  | levelDimension
Represents a level dimension.
 API_AngleDimensionType  | angleDimension
Represents an angle dimension.
 API_TextType  | text
Represents a text.
 API_LabelType  | label
Represents a label.
 API_ZoneType  | zone
Represents a zone.
 API_HatchType  | hatch
Represents a hatch.
 API_LineType  | line
Represents a 2D line.
 API_PolyLineType  | polyLine
Represents a 2D polyline.
 API_ArcType  | arc
Represents a 2D arc.
 API_CircleType  | circle
Represents a 2D circle.
 API_SplineType  | spline
Represents a 2D spline.
 API_HotspotType  | hotspot
Represents a hotspot.
 API_PictureType  | picture
Represents a picture.
 API_CutPlaneType  | cutPlane
Represents a section.
 API_ElevationType  | elevation
Represents an elevation.
 API_InteriorElevationType  | interiorElevation
Represents an interior elevation.
 API_CameraType  | camera
Represents a camera.
 API_CamSetType  | camset
Represents a camera set.
 API_DrawingType  | drawing
Represents a drawing element.
 API_SectElemType  | sectElem
Represents an element in the section window.
 API_DetailType  | detail
Represents a detail drawing.
 API_WorksheetType  | worksheet
Represents a worksheet.
 API_HotlinkType  | hotlink
Represents a hotlink.
 API_CurtainWallType  | curtainWall
Represents a curtain wall.
 API_CWSegmentType  | cwSegment
Represents a curtain wall segment.
 API_CWFrameType  | cwFrame
Represents a curtain wall frame.
 API_CWPanelType  | cwPanel
Represents a curtain wall panel.
 API_CWJunctionType  | cwJunction
Represents a curtain wall junction.
 API_CWAccessoryType  | cwAccessory
Represents a curtain wall accessory.
 API_ShellType  | shell
Represents a shell (kind of a roof with special geometry).
 API_MorphType  | morph
Represents a morph.
 API_SkylightType  | skylight
Represents a skylight (a window put into roofs and shells).
 API_ChangeMarkerType  | changeMarker
Represents a ChangeMarker.
 API_StairType  | stair
Represents a Stair.
 API_StairRiserType  | stairRiser
Represents a Riser.
 API_StairTreadType  | stairTread
Represents a Tread.
 API_StairStructureType  | stairStructure
Represents a Stair structure.
 API_RailingType  | railing
Represents a Railing structure.
 API_RailingToprailType  | railingToprail
Represents a Toprail structure.
 API_RailingHandrailType  | railingHandrail
Represents a Handrail structure.
 API_RailingRailType  | railingRail
Represents a Rail structure.
 API_RailingRailEndType  | railingToprailEnd
Represents a Toprail End structure.
 API_RailingRailEndType  | railingHandrailEnd
Represents a Handrail End structure.
 API_RailingRailEndType  | railingRailEnd
Represents a Rail End structure.
 API_RailingFinishType  | railingEndFinish
Represents the finish of a Rail End element.
 API_RailingRailConnectionType  | railingToprailConnection
Represents a Toprail Connection structure.
 API_RailingRailConnectionType  | railingHandrailConnection
Represents a Handrail Connection structure.
 API_RailingRailConnectionType  | railingRailConnection
Represents a Rail Connection structure.
 API_RailingPostType  | railingPost
Represents a Railing Post structure.
 API_RailingInnerPostType  | railingInnerPost
Represents an Inner Post structure.
 API_RailingBalusterSetType  | railingBalusterSet
Represents a Baluster Set structure.
 API_RailingBalusterType  | railingBaluster
Represents a Baluster structure.
 API_RailingPanelType  | railingPanel
Represents a Railing Panel structure.
 API_RailingNodeType  | railingNode
Represents a Railing Node structure.
 API_RailingSegmentType  | railingSegment
Represents a Railing Segment structure.
 API_RailingPatternType  | railingPattern
Represents a Railing Pattern structure.
 API_ColumnSegmentType  | columnSegment
Represents a Column segment structure.
 API_BeamSegmentType  | beamSegment
Represents a Beam segment structure.
 API_OpeningType  | opening
Represents an Opening.
 API_ExternalElemType  | externalElem
Represents an external element. See remarks for more information.
Detailed Description
A union collecting all known element types.
Since
Archicad 26
Remarks
Database items named elements are global collections of constuction and drawing elements which are placed onto the floorplan, Section/Elevation etc. windows. API functions operating on the element databases begin with the ACAPI_Element_ prefix, refer to the Element Manager for more details. Many element related functions use the API_Element structure on the parameter list. As a general rule, you have to fill the required fields in the union, then the server application parses the request based on the values and passes the return parameters in the same parameter. This is why most of the functions do not have the const directive in the prototypes. Refer to the Save data into the Element records document to get information how to save/assign custom data to the element records and save it into the project file for later use. In version 26 the Analytical element types were replaced by the externalElem member. The former structures (e.g. API_AnalyticalLinkType) can be obtained by the appropriate functions (e.g. ACAPI_Analytical_GetLinkFromElement).